import { prisma } from "@/lib/prisma";

export const seedCompetencies = async () => {
  await prisma.competency.createMany({
    data: [
      {
        id: "FC4G",
        name: "หุ้นส่วนเชิงธุรกิจ HR",
        definition: "ความสามารถในการเป็นที่ปรึกษาเชิงกลยุทธ์ด้านทรัพยากรบุคคลให้กับธุรกิจ",
        type: "FC",
      },
      {
        id: "MC3",
        name: "การวางแผนและการดำเนินกลยุทธ์",
        definition: "ความสามารถในการกำหนด วางแผน และดำเนินกลยุทธ์อย่างมีประสิทธิภาพ",
        type: "MC",
      },
      {
        id: "MC6",
        name: "การสื่อสารและนำเสนออย่างมีประสิทธิภาพ",
        definition: "สื่อสารและนำเสนองานในระดับหน่วยงาน หรือเป็นตัวแทนในการนำเสนอผลงาน/โครงการของหน่วยงานและเจรจาต่อรองกับผู้เกี่ยวข้องในระดับหน่วยงานให้สามารถบรรลุเป้าหมายที่ตั้งไว้  มีความเข้าใจความเหมาะสมของสถานการณ์และสามารถสื่อสารประเด็นที่มีความซับซ้อนในระดับหน่วยงานได้ โดยสามารถสื่อสารภาษาต่างประเทศได้ในหน่วยงานที่ต้องติดต่อสื่อสารกับลูกค้าต่างประเทศ",
        type: "MC",
      },
      {
        id: "MC4",
        name: "การวางแผนเชิงกลยุทธ์และผลักดันให้เกิดผลสำเร็จ",
        definition: `- กำหนดแนวทางในการจัดการกับปัญหาหรือสถานการณ์ รวมทั้งปรับกลยุทธ์มาใช้ในการทำงานของหน่วยงาน
        - สนับสนุนการพัฒนากระบวนการจัดทำแผนกลยุทธ์และแผนปฏิบัติการของหน่วยงาน
        - มอบหมายงานท้าทายที่เหมาะสมให้กับสมาชิกในทีม และกระตุ้นทีมให้มุ่งมั่นเอาชนะอุปสรรคและมีแรงบันดาลใจ
        - รับฟังและสร้างการมีส่วนร่วมของทุกคนในฝ่ายงานให้ผลักดันงานให้สำเร็จ
        `,
        type: "MC",
      },
      {
        id: "DAAI",
        name: "ดิจิทัลและ AI",
        definition: "ความสามารถในการใช้เครื่องมือดิจิทัลและปัญญาประดิษฐ์เพื่อยกระดับกระบวนการ",
        type: "TC",
      },
      {
        id: "MD",
        name: "แดชบอร์ดการติดตาม",
        definition: "ความสามารถในการพัฒนาและใช้แดชบอร์ดเพื่อวิเคราะห์ข้อมูล",
        type: "CC",
      },
      {
        id: "FC49",
        name: "การเป็น HR ที่เป็นพันธมิตรที่ดีทางธุรกิจ",
        definition: "นำองค์ความรู้ประกอบการตัดสินใจของผู้บริหาร วิเคราะห์และแก้ปัญหาในการทำงาน บริหารจัดการข้อมูล  ให้คำปรึกษางานด้านทรัพยากรบุคคล ค้นหาแนวความคิด องค์ความรู้ ระบบและวิธีการรวมทั้งเครื่องมือในการทำงาน พร้อมส่งต่อความรู้ในงานทรัพยากรบุคคลได้",
        type: "FC",
      },
      {
        id: "FC50",
        name: "การเป็นศูนย์กลางความเป็นเลิศในงาน HR – ด้านการจัดการองค์กร (OD)",
        definition: "มีความเชี่ยวชาญในสายงานที่ตนรับผิดชอบเพื่อตอบโจทย์ด้านกลยุทธ์ในระดับหน่วยงาน  เน้นการคิดแบบ Think Organizationally  คาดการณ์และวางแผนรับมือกับการเปลี่ยนแปลง แปลงกลยุทธ์เป็นแผนการปฏิบัติงานในการพัฒนาองค์กรอย่างเป็นรูปธรรม และ ร่วมออกแบบกระบวนการทำงานของฝ่ายต่างๆ",
        type: "FC",
      },
    ],
  })
}