import { prisma } from "@/lib/prisma";

export const seedCompetencies = async () => {
  await prisma.competency.createMany({
    data: [
      {
        id: "CC5",
        name: "การปฏิบัติตามระบบบริหารคุณภาพ (IATF:16949/ISO 9001)",
        definition: "- บริหารจัดการ พัฒนา ควบคุมการปฏิบัติ ตามระบบคุณภาพ IATF16949  หรือ ISO 9001ของฝ่าย/ แผนก - วิเคราะห์ได้ถึงปัญหาความสามารถในการปฏิบัติตามข้อกำหนด บริหารจัดการ พัฒนา ควบคุมการปฏิบัติ ตามระบบคุณภาพของฝ่าย/ แผนก",
        type: "CC",
        t1: "อธิบายข้อกำหนด และวิธีปฏิบัติที่เกี่ยวข้องกับงานที่รับผิดชอบ",
        t2: "ปฏิบัติงานตามมาตรฐานในงานที่รับผิดชอบ",
        t3: "- ความรู้ ทักษะการดำเนินงานตามระบบบริหารคุณภาพ IATF16949 หรือ ISO 9001 ของฝ่าย/ แผนก - วิเคราะห์ได้ถึงปัญหาความสามารถในการปฏิบัติตามข้อกำหนด",
        t4: `- บริหารจัดการ พัฒนา ควบคุมการปฏิบัติ ตามระบบคุณภาพ IATF16949  หรือ ISO 9001ของฝ่าย/ แผนก
 - วิเคราะห์ได้ถึงปัญหาความสามารถในการปฏิบัติตามข้อกำหนด บริหารจัดการ พัฒนา ควบคุมการปฏิบัติ ตามระบบคุณภาพของฝ่าย/ แผนก`,
        t5: "เนื่องจากประเภท CC , TC มีระดับ PL1  - PL4 ซึ่ง PL4 เป็นระดับสูงสุด จึงไม่มี PL5 ",
      },
      {
        id: "CC6",
        name: "การปฏิบัติตามระบบสิ่งแวดล้อม ISO:14001",
        definition: "- บริหารจัดการ พัฒนา ควบคุมการปฏิบัติ ตามระบบสิ่งแวดล้อม ISO:14001 ของฝ่าย/ แผนก - วิเคราะห์ได้ถึงปัญหาความสามารถในการปฏิบัติตามข้อกำหนด บริหารจัดการ พัฒนา ควบคุมการปฏิบัติ ตามระบบของฝ่าย/ แผนก",
        type: "CC",
      },
      {
        id: "TC009",
        name: "การวิเคราะห์ข้อมูลเชิงสถิติ",
        definition: "- การตีความหมายของข้อมูล  (Interpretation Data) นำผลที่ได้จากการวิเคราะห์ข้อมูลทางสถิติ เพื่อนำข้อสรุปที่ได้มาใช้ให้เกิดประโยชน์ - สอนผู้อื่นถึงขั้นตอน และวิธีการแปลผลข้อมูลทางสถิติ",
        type: "TC",
      },
      {
        id: "TC069",
        name: "การจัดการข้อมูลสารสนเทศงานทรัพยากรบุคคล (HRIS)",
        definition: "- ให้คำแนะนำ และตอบคำถามที่เกี่ยวข้องกับการใช้งานระบบเทคโนโลยีสารสนเทศในงานทรัพยากรบุคคลได้ - นำเสนอทางเลือกเพื่อใช้ในการแก้ปัญหาที่เกิดขึ้นจากการใช้งานระบบเทคโนโลยีสารสนเทศ",
        type: "TC",
      },
      {
        id: "TC074",
        name: "การบริหารและพัฒนาทรัพยากรบุคคล",
        definition: "- สามารถวิเคราะห์ปัญหาที่เกิดขึ้นเกี่ยวกับระบบงานของหน่วยงาน พร้อมทั้งนำเสนอแนวทางการแก้ปัญหาได้ - สอน และให้คำแนะนำแก่ผู้อื่นถึงวิธีการ ขั้นตอนการทำงานทีมีประสิทธิภาพ และสามารถลดขั้นตอนที่ยุ่งยาก ซับซ้อนได้",
        type: "TC",
      },
      {
        id: "TC075",
        name: "การบริหารและวิเคราะห์ข้อมูลด้านทรัพยากรบุคคล",
        definition: "- วิเคราะห์ ออกแบบ และวางแผนการจัดระบบฐานข้อมูลด้านทรัพยากรบุคคลให้มีประสิทธิภาพและตอบสนองการใช้งาน - กำหนดแนวทางการจัดเก็บข้อมูล การดึงข้อมูล และการเชื่อมโยงระบบฐานข้อมูลให้มีประสิทธิภาพสูงสุด - สามารถมองภาพรวมของกระบวนการดำเนินงาน เพื่อวิเคราะห์ข้อมูลอย่างเป็นระบบ - สอน และอธิบายแนวทาง ขั้นตอนการวิเคราะห์ข้อมูล การเลือกใช้สถิติ และสามารถตอบคำถามปัญหาเกี่ยวกับข้อมูลด้านทรัพยากรบุคคลได้",
        type: "TC",
      },
      {
        id: "TC077",
        name: "การบริหารจัดการระบบงานทรัพยากรบุคคล",
        definition: "- สามารถวิเคราะห์ปัญหาที่เกิดขึ้นเกี่ยวกับระบบงานของหน่วยงาน พร้อมทั้งนำเสนอแนวทางการแก้ปัญหาได้ - สอน และให้คำแนะนำแก่ผู้อื่นถึงวิธีการ ขั้นตอนการทำงานทีมีประสิทธิภาพ และสามารถลดขั้นตอนที่ยุ่งยาก ซับซ้อนได้ - สามารถคาดการณ์ปัญหาที่อาจจะเกิดขึ้นจากแผน และวางแผนเพื่อปรับเปลี่ยนแผนให้สอดคล้องกับสถานการณ์ได้ - ปรับปรุง พัฒนาแผนงานด้านทรัพยากรบุคคลให้มีประสิทธิภาพมากยิ่งขึ้น",
        type: "TC",
      },
      {
        id: "FC1B",
        name: "การสร้างความเข้าใจที่ตรงกันเกี่ยวกับกลยุทธ์องค์กร (Strategic Alignment)",
        definition: "กำหนดกระบวนการในการมีส่วนร่วมของตัวแทนจากทุกหน่วยงาน แปลงกลยุทธ์เป็นวิธีการที่มีการสนับสนุนที่ชัดเจนในเรื่องของหน่วยงาน ระยะเวลา งบประมาณ และทรัพยากรอื่นๆ ที่จำเป็นเพื่อผลักดันให้สามารถปฏิบัติตามกลยุทธ์ได้",
        type: "FC",
      },
      {
        id: "FC49",
        name: "การเป็น HR ที่เป็นพันธมิตรที่ดีทางธุรกิจ (HRBP  (HR Business Partnership))",
        definition: "นำองค์ความรู้ประกอบการตัดสินใจของผู้บริหาร วิเคราะห์และแก้ปัญหาในการทำงาน บริหารจัดการข้อมูล  ให้คำปรึกษางานด้านทรัพยากรบุคคล ค้นหาแนวความคิด องค์ความรู้ ระบบและวิธีการรวมทั้งเครื่องมือในการทำงาน พร้อมส่งต่อความรู้ในงานทรัพยากรบุคคลได้",
        type: "FC",
      },
      {
        id: "FC50",
        name: "การเป็นศูนย์กลางความเป็นเลิศในงาน HR – ด้านการจัดการองค์กร (OD) (COE – Organization  (Center of Excellence))",
        definition: "มีความเชี่ยวชาญในสายงานที่ตนรับผิดชอบเพื่อตอบโจทย์ด้านกลยุทธ์ในระดับหน่วยงาน  เน้นการคิดแบบ Think Organizationally  คาดการณ์และวางแผนรับมือกับการเปลี่ยนแปลง แปลงกลยุทธ์เป็นแผนการปฏิบัติงานในการพัฒนาองค์กรอย่างเป็นรูปธรรม และ ร่วมออกแบบกระบวนการทำงานของฝ่ายต่างๆ",
        type: "FC",
      },
      {
        id: "FC51",
        name: "การเป็นศูนย์กลางความเป็นเลิศในงาน HR - ด้านบุคลากร (HRM/HRD))",
        definition: "เป็นตัวแทนของฝ่ายงานทรัพยากร (HR Ambassador)  กำหนดมาตรฐานในการถ่ายทอดความรู้และทักษะผ่านรูปแบบที่หลากหลายในระดับฝ่ายงาน และสนับสนุนการทำงานของผู้บริหารระดับกลางได้",
        type: "FC",
      },
      {
        id: "FC52",
        name: "การให้บริการที่เป็นเลิศในงาน HR (HR Service Excellence)",
        definition: "เป็นตัวแทนในการขับเคลื่อนให้ดำเนินการตาม  Vision Mission Strategy และ Core Culture  สนับสนุนการวางแผนและออกแบบกลยุทธ์การให้บริการที่เป็นเลิศทาง HR ให้ตอบสนองกับความต้องการของบุคลากรในองค์กร",
        type: "FC",
      },
      {
        id: "MC1",
        name: "การมุ่งมั่นในการส่งมอบงานที่มีคุณภาพ (Work Standard & Quality Orientation)",
        definition: "กำหนดหน้าที่ความรับผิดชอบในการปฏิบัติตามระบบมาตรฐานและระบบคุณภาพต่างๆ ทบทวนและปรับปรุง ตรวจสอบแก้ไข และประยุกต์ใช้แนวคิดและตัวชี้วัดในการบริหารคุณภาพสู่การปฏิบัติงาน",
        type: "MC",
      },
      {
        id: "MC10",
        name: "การบริหารจัดการทีมและสร้างพันธมิตร (Team Leadership & Partnering)",
        definition: "กำหนดกลยุทธ์ของการทำงานในทีม  บทบาทและหน้าที่ของสมาชิกในทีมให้เชื่อมโยงกับเป้าหมายขององค์กร และปฏิบัติหน้าที่เป็นผู้นำในการบริหารจัดการ Team รวมทั้ง แนะนำเทคนิคในการปฏิสัมพันธ์กับบุคคลหรือองค์กรเป้าหมาย รวมทั้งการสนทนาและการตึ้งคำถามที่ถูกต้องเพื่อให้บรรลุเป้าหมายในการสร้างความสัมพันธ์",
        type: "MC",
      },
      {
        id: "MC2",
        name: "การคิดอย่างเจ้าของ (Sense of Ownership)",
        definition: "แสดงออกถึงความเป็นเจ้าของร่วมกันของงาน/โครงการในระดับหน่วยงาน มีส่วนร่วมในการกำหนดเป้าหมายของหน่วยงาน/ฝ่ายงาน  มีการนำระบบต่างๆ มาสนับสนุนและพัฒนางาน/โครงการ ค้นหาวิธีการ รูปแบบการทำงานใหม่ๆ จากภายนอกมาปรับปรุงงานให้ดีขึ้น สามารถบริหารจัดการทรัพยากรให้เกิดประโยชน์ต่อองค์กร",
        type: "MC",
      },
      {
        id: "MC3",
        name: "การร่วมมือร่วมใจและการทำงานเป็นทีม (Collaboration & Teamwork)",
        definition: "มีการกำหนดบทบาทและหน้าที่ของสมาชิกในทีมให้เชื่อมโยงกับเป้าหมายขององค์กร และปฏิบัติหน้าที่เป็นผู้นำในการบริหารจัดการทีม เป็นผู้นำทีม/โครงการที่ได้รับมอบหมาย โดยออกแบบและจัดการงานได้อย่างมีประสิทธิภาพ มีการสนับสนุนให้ทีมบรรลุเป้าหมายที่ตั้งไว้",
        type: "MC",
      },
      {
        id: "MC4",
        name: "การสื่อสารและนำเสนออย่างมีประสิทธิภาพ (Effective Communication & Presentation)",
        definition: "สื่อสารและนำเสนองานในระดับหน่วยงาน หรือเป็นตัวแทนในการนำเสนอผลงาน/โครงการของหน่วยงานและเจรจาต่อรองกับผู้เกี่ยวข้องในระดับหน่วยงานให้สามารถบรรลุเป้าหมายที่ตั้งไว้  มีความเข้าใจความเหมาะสมของสถานการณ์และสามารถสื่อสารประเด็นที่มีความซับซ้อนในระดับหน่วยงานได้ โดยสามารถสื่อสารภาษาต่างประเทศได้ในหน่วยงานที่ต้องติดต่อสื่อสารกับลูกค้าต่างประเทศ",
        type: "MC",
      },
      {
        id: "MC6",
        name: "การวางแผนเชิงกลยุทธ์และผลักดันให้เกิดผลสำเร็จ (Strategic Planning & Driving for Result)",
        definition: "- มีความรู้และเข้าใจกลยุทธ์องค์กรและสามารถเชื่อมโยงงานของตนเองกับกลยุทธ์องค์กร - ปฏิบัติงานด้วยความเต็มใจและมีแรงบันดาลใจในการทำงานอย่างต่อเนื่อง - พยายามทำงานให้บรรลุเป้าหมายของตน และแสดงออกถึงการปรับปรุงพัฒนางานให้ดีขึ้น",
        type: "MC",
      },
      {
        id: "MC7",
        name: "การนำและบริหารการเปลี่ยนแปลง (Leading & Managing Change)",
        definition: "ให้คำแนะนำที่นำไปใช้ได้จริง ปรับแนวคิดและวิธีการของหน่วยงานที่ส่งผลกระทบด้านลบต่อหน่วยงาน ตลอดจนให้กำลังใจผู้อื่นในการบริหารจัดการความเครียดได้อย่างมีประสิทธิภาพ สร้างความยืดหยุ่น และพร้อมรับมือกับสถานการณ์ต่างๆ",
        type: "MC",
      },
      {
        id: "MC8",
        name: "การพัฒนาและให้คำชี้แนะผู้อื่น (Developing & Coaching Others)",
        definition: "สามารถดำเนินการ Coaching หรือการให้ Feedback เบื้องต้น โดยสื่อสารให้เข้าใจ ค้นหาช่องทางในการพัฒนาสมรรถนะ สนับสนุน ให้กำลังใจ และใช้เทคนิคในการกระตุ้นเกิดความรับผิดชอบ",
        type: "MC",
      },
      {
        id: "MC9",
        name: "การแก้ปัญหาและตัดสินใจ (Problem Solving & Decision Making)",
        definition: "วิเคราะห์ประเด็นต่างๆ อย่างเป็นระบบ ระบุผลกระทบ และความเสี่ยงในแต่ละทางเลือก พิจารณาหาข้อเสนอแนะและทางเลือกแล้วดำเนินการแก้ปัญหาได้  รวมทั้ง ประเมินความเหมาะสมของการดำเนินงานในปัจจุบันเพื่อระบุปัญหาที่อาจจะเกิดขึ้นล่วงหน้า ระบุถึงความเสี่ยงและผลกระทบ  แนวทางการปรับปรุงกระบวนการแก้ปัญหาหรือการตัดสินใจได้",
        type: "MC",
      },
    ],
  })
}