[
  {
    "cultureCode": "S",
    "cultureName": "Spirit of Commitment, Integrity & Ethics",
    "description": "การปฏิบัติหน้าที่ด้วยความซื่อสัตย์และส่งมอบงานตามข้อตกลงหรือสัญญาที่ได้ตกลงกันไว้ ด้วยความโปร่งใส",
    "beliefs": [
      "ปฏิบัติให้ได้ตามกฎและระเบียบที่กำหนดไว้",
      "รักษาคำพูด ตามที่ได้ตกลงไว้",
      "ใช้ข้อมูลและข้อเท็จจริงในการทำงาน"
    ]
  },
  {
    "cultureCode": "M",
    "cultureName": "Mastery of Learning & Applying Technology",
    "description": "การตั้งใจเรียนรู้สิ่งใหม่ๆ รวมถึงเทคโนโลยี และนำมาใช้ปรับปรุง พัฒนา การทำงาน บริการ หรือผลิตภัณฑ์ ให้ดีขึ้นอย่างต่อเนื่อง",
    "beliefs": [
      "กล้าเรียนรู้สิ่งใหม่ๆ ทั้งวิธีการ เครื่องมือ และเทคโนโลยี",
      "กล้าตัดสินใจ กล้าลงทุน กล้าเสี่ยง บนพื้นฐานต้นทุนและความเป็นไปได้ทางธุรกิจ",
      "กล้านำสิ่งที่เรียนรู้มาลองทำอย่างจริงจัง กล้าเข้าให้เกิดการเปลี่ยนแปลง และเกิดสิ่งใหม่ๆ"
    ]
  },
  {
    "cultureCode": "A",
    "cultureName": "Agility",
    "description": "การเปิดรับสิ่งใหม่ วางแผนปรับตัว เตรียมความพร้อมสำหรับการเปลี่ยนแปลงอย่างรวดเร็ว",
    "beliefs": [
      "เปลี่ยนแปลงให้ทันต่อเหตุการณ์ที่เปลี่ยนไป และปรับตัวได้รวดเร็วทันที",
      "แสวงหาการแก้ไขเพื่อสอดรับต่อการเปลี่ยนแปลง",
      "คิดสร้างสรรค์และมองวิธีการทำงานรวดเร็ว ทันต่อเหตุการณ์"
    ]
  },
  {
    "cultureCode": "R",
    "cultureName": "Respect Others & Value Diversity",
    "description": "การยอมรับความแตกต่าง และเปิดใจรับฟังความคิดเห็นของทุกคนในทีมเพื่อหาแนวทางที่ดีที่สุดในการแก้ไขปัญหา",
    "beliefs": [
      "ยอมรับความคิดเห็นและความเห็นต่าง",
      "ร่วมหาแนวทางและยอมรับประโยชน์ที่ดีที่สุด",
      "เปิดรับฟังความคิดเห็นผู้อื่น"
    ]
  },
  {
    "cultureCode": "T",
    "cultureName": "Think Customers & Think Value",
    "description": "การทำความเข้าใจความคาดหวังของลูกค้า (ทั้งภายในและภายนอก) อย่างต่อเนื่อง และใส่ใจในคุณค่าของงานและบริการที่ส่งมอบให้ลูกค้า",
    "beliefs": [
      "รับฟังข้อเสนอแนะจากลูกค้า และความต้องการของลูกค้า",
      "Customer Centric คิดในมุมที่แก้ปัญหาที่แท้จริงและตอบโจทย์ลูกค้าเสมอ",
      "ส่งมอบงาน บริการ และคุณค่าตามที่องค์กรลูกค้าคาดหวัง"
    ]
  }
]